---
kind: method
id: M:Autodesk.Revit.DB.WorksetId.GetHashCode
source: html/7434623f-e668-d6cd-18d6-f17bf707b9fb.htm
---
# Autodesk.Revit.DB.WorksetId.GetHashCode Method

Gets the integer value of the id as hash code

## Syntax (C#)
```csharp
public override int GetHashCode()
```